# EndShortening Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralElementDefinitionData..::..EndShortening Property
StructuralElementDefinitionData Class See Also
---
Cutback or extension at element curve end.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public double EndShortening { get; }
```

Visual Basic
---
```text
Public ReadOnly Property EndShortening As Double
	Get
```

Visual C++
---
```text
public:
property double EndShortening {
	double get ();
}
```

# See Also
StructuralElementDefinitionData Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace